#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
github_team.teams["infrastructure"]: Refreshing state... [id=6847100]
github_team.teams["content"]: Refreshing state... [id=6847102]
github_team.teams["tech-lead"]: Refreshing state... [id=6847098]
github_team.teams["distribution"]: Refreshing state... [id=6847101]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_team.teams["continuous-integration"]: Refreshing state... [id=6847099]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=mirror-commerce-admin.en]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=mirror-commerce-operations.en]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_membership.users["damienwebdev"]: Refreshing state... [id=Mage-OS:damienwebdev]
github_membership.users["sprankhub"]: Refreshing state... [id=Mage-OS:sprankhub]
github_membership.users["johnhughes1984"]: Refreshing state... [id=Mage-OS:johnhughes1984]
github_membership.users["mage-os-ci"]: Refreshing state... [id=Mage-OS:mage-os-ci]
github_membership.users["wigman"]: Refreshing state... [id=Mage-OS:wigman]
github_membership.users["DavidLambauer"]: Refreshing state... [id=Mage-OS:DavidLambauer]
github_membership.users["Vinai"]: Refreshing state... [id=Mage-OS:Vinai]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=6847100:damienwebdev]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=6847100:Vinai]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=6847098:Vinai]
github_team_membership.members["mage-os-ci_continuous-integration"]: Refreshing state... [id=6847099:mage-os-ci]
github_team_membership.members["DavidLambauer_infrastructure"]: Refreshing state... [id=6847100:DavidLambauer]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=6847102:johnhughes1984]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=6847102:Vinai]
github_team_membership.members["wigman_content"]: Refreshing state... [id=6847102:wigman]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=6847101:Vinai]
github_team_membership.members["damienwebdev_distribution"]: Refreshing state... [id=6847101:damienwebdev]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=6847100:sprankhub]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=6847101:sprankhub]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mage-os-website"]: Refreshing state... [id=mage-os-website/CODEOWNERS]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=6847098:infrastructure]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=6847098:generate-mirror-repo-js]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=6847098:mageos-magento2-sample-data]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=6847098:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=6847098:mageos-security-package]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=6847098:mage-os-website]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=6847098:mageos-commerce-data-export]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=6847098:mageos-magento2]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=6847098:namespace]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=6847098:mageos-magento-composer-installer]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=6847098:mageos-magento2-page-builder]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=6847098:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=6847098:mageos-composer-dependency-version-audit-plugin]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=6847098:mageos-adobe-stock-integration]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=6847098:terraform]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=6847098:mageos-inventory]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=6847100:namespace]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-magento-composer-installer]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=6847101:mageos-security-package]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=6847100:infrastructure]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=6847101:mageos-inventory]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-root-update-plugin]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=6847102:mage-os-website]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=6847101:mageos-magento2-sample-data]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-inventory-composer-installer]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=6847100:generate-mirror-repo-js]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=6847101:mageos-adobe-stock-integration]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=6847101:mageos-commerce-data-export]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=6847101:mageos-magento2]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=6847101:mageos-magento2-page-builder]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDOISixH84BzuWN]
github_branch_protection.repositories["mage-os-website"]: Refreshing state... [id=BPR_kwDOGCTTT84BysLE]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOISiZ3M4BzuWZ]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDOIShsYM4BzuWO]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOISiM084BzuWR]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOISiVZc4BzuWM]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDOGta9mM4B0QmJ]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDOIShpTM4BzuWV]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDOGHBGY84BysK_]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOISihV84BzuWa]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOISiqV84BzuWX]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDOGIl6i84BysLC]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDOHNQe7c4BysLD]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOISivQc4BzuWP]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOISimRc4BzuWh]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDOH66Nbs4BysK-]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDOHynKTc4By-d9]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOGMKAG84By-dP]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDOIIQUpM4By-eH]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOG1y6y84By-df]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOG8FefM4By-dZ]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDOGMKCY84By-d1]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOG1y7C84By-d5]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOG8L6gs4By-eB]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDOGMKFF84By-dc]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDOG8FV-s4By-dL]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOGMKCJ84By-dW]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDOGMKBz84By-dN]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDOGHBHCc4By-d4]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDOGMKC6M4By-d2]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDOGwaLE84By-dS]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOG3Ro_84By-dJ]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDOG3Rr984By-dH]
github_branch_protection.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=BPR_kwDOH_yQpc4B1Gmt]
github_branch_protection.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=BPR_kwDOH_yQXM4B1Gm0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_membership.users["DavidLambauer"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"8b47918281ce7cad76035dfc5e988e473cfab19d9486bb2763e3f92d1d768134\"" -> "W/\"a56d864550f929fb76ea58627507f1c413c55152dbf0dec6dee4dcce77b2c880\""
        id       = "Mage-OS:DavidLambauer"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["Vinai"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"46e842fca140110f8ce594bb1dab3a8b26e113e6d35ec217ad7f43b95f1700fd\"" -> "W/\"179c706d9fcbfb0dd4511ab3c0d29da61491354ccaaf91e24e51ef0b7c82812a\""
        id       = "Mage-OS:Vinai"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["damienwebdev"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"7851c07114ea8e3800d6008b7bff10360ba97b40ed534bca14716333344602df\"" -> "W/\"1d3dd9ff26ea01098e24373c644e3fd44da07c40438eefc32aefff2caf1a6421\""
        id       = "Mage-OS:damienwebdev"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["johnhughes1984"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"eef126a659829a12eb3392476ff761ff9e8273f51127ca571831694c49ab921e\"" -> "W/\"73b67f40a7b08437dbd00b6013079af406fadce8bf68b02970c660f82d90bf19\""
        id       = "Mage-OS:johnhughes1984"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["mage-os-ci"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"e24c1b119ab148e2c560dca0f74c3fbc0958f334a299820d0978a9864c46c130\"" -> "W/\"74514cc7df89414d393b15dfb2ef053b75900bad720922e06cbeb30754b4a184\""
        id       = "Mage-OS:mage-os-ci"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["sprankhub"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"b3c5655de0a86aa4db9e40c1935f5a10c8bf284c113e50dbe28c5bf4c5fce208\"" -> "W/\"01e5f8e5e320f430bf14860bfc9debe3acffde216f5e96ad441a91db6d2d603f\""
        id       = "Mage-OS:sprankhub"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["wigman"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"9575ca1efae1033e87c812e644eb37326d426b60ce39c4ad4a11ae391f0c695c\"" -> "W/\"3295a37b9c3748dda7e77bffd7fcd0f95abab517c24cfbde141af1999c364167\""
        id       = "Mage-OS:wigman"
        # (2 unchanged attributes hidden)
    }

  # github_team.teams["content"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"3e448e853394bd7929bda7e2549cf406d1af00b6b44b0617c1bc90ed03c29561\"" -> "W/\"dbfaf3f55b1538dcbd236a2ddf59d2d41445e9587057f51684a1cde6161c53b8\""
        id                        = "6847102"
      ~ members_count             = 3 -> 4
        name                      = "content"
        # (5 unchanged attributes hidden)
    }

  # github_team.teams["continuous-integration"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"824dbf44c02003a3bacab8d777af0df978bb08119ece27c471fc4bd36fd4b616\"" -> "W/\"7e78142d08756a25492ae4450e3b7e22aad17cf13d1013673f123710a89de316\""
        id                        = "6847099"
        name                      = "continuous-integration"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["distribution"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"0ef8c21dde097e2854ba5cc1a2bd0f57ffd5f6d9907f544570066e6b2f5d79e8\"" -> "W/\"ac404e09d41c507d044cd2efdc21ef063b95afac1723aebda2836b67b698ac28\""
        id                        = "6847101"
        name                      = "distribution"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["infrastructure"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"240e33907dfbcbcf9088a674712c1baf7bfcb5abc3e2d81a0f82c12359be04e6\"" -> "W/\"c0f64b0cdfee3d4f7707d93a0423a296da2d9810d53ed824261c2389c40b7b91\""
        id                        = "6847100"
        name                      = "infrastructure"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["tech-lead"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"e23469d9dc7f40e72756e0a675239cbcd3155c4157604c6307d2d576ea6afd40\"" -> "W/\"5101a9c4518a6bc0935f7366274c2f06ed3112fd033857ff9bdd40ba6d105b4f\""
        id                        = "6847098"
        name                      = "tech-lead"
        # (6 unchanged attributes hidden)
    }

  # github_team_membership.members["DavidLambauer_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"a4f63e5d2f512f6e79a894351aa8523d641eab3ac6d96098dab28669a9b37ed5\"" -> "W/\"2734f0ac892cceb95c329aa01649adc595845ccc2976909ef1e73d4b4190ff95\""
        id       = "6847100:DavidLambauer"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"68380fdd7cb0420ec8d076fad42f6493e4f68fb57c30252757b7131782e4eefe\"" -> "W/\"1ed3adb99b83c72879357e2d5249ca2699bbaf981bbf2685c15078eff7b84581\""
        id       = "6847102:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"c74517050c1e4e34a519b35c6e43d28cf0ec4caf7c5929bfae6120b5d3a60340\"" -> "W/\"7139c5942b1e441f9da8bbd62f612a119fed995efbb63d9c78a53430ac914546\""
        id       = "6847101:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"99b920a757e27b2aae8efd7f8faf390aa88fbc941601c82b5d1e342b01f37bab\"" -> "W/\"f0c6bf4082db9ef4151b2cc407aae7561c9608696b2f75c54dbbbb0685176aa1\""
        id       = "6847100:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_tech-lead"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"fd32fa0fd20e3203be1b38eb977def0002ec58a36ade657b0055a5050d85944d\"" -> "W/\"73b8f8c32d1a5ce6b7cff7d9bc7602248c59d6dde99a6f296e771186346b9531\""
        id       = "6847098:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"cd856997b974e6051a486ea9e57643237b74897b57a401140b93812695c9f9c1\"" -> "W/\"aa49dfb93e0e386c881faf4b974f1a545b40a65f6c1dd599cbbbc7ef16abfa2b\""
        id       = "6847101:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"d48e582c723165771e14e4ffbb9676c6b6d8406381fafe7053d0ac65e2090045\"" -> "W/\"7dae7e4963f64b6a1e2d0f274fee0a1b5617a3a8d5b734d2163b7ea4646b1e3f\""
        id       = "6847100:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["johnhughes1984_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"230be3d4fb1963bb3ef548752f8f960cf9204221afb9ef4968260d3516377c7b\"" -> "W/\"7471ad20ba0311579b9295581c06b92039ae76c067853cf535c8feae3fbfe66f\""
        id       = "6847102:johnhughes1984"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["mage-os-ci_continuous-integration"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"8bf536e599698add5a1a949378c9a48357a3f26f0de82961b79a2069016ce075\"" -> "W/\"c07dd1487b6ba348683f03b418a2d1dff1382bdd4c441f1ef990e9a1dceb28a3\""
        id       = "6847099:mage-os-ci"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"786973c7428f044a0d6d12d0589d3ea6a263cc83e14534a0ac69e63f27fa1fa5\"" -> "W/\"c5ee01feff0ac1a3538f561c0c9dfcffe042d1e15d1006124a53cb68fdf39fc8\""
        id       = "6847101:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"71a5aabc1478fc8566a938c367721e27a4c6be83a12a50a3da3e385f0c7af842\"" -> "W/\"43f7ad2a94570e6bedc2007619976021076651487303286f817b9ef83a664f01\""
        id       = "6847100:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["wigman_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"abab95de043a8f1f94e2bc5e458d7b093820177eceecd0746055b1f2a55eb8d7\"" -> "W/\"568dbcf937d68ed31a55cad8f5b109627112cea2329b83fd89cbbcb48d041687\""
        id       = "6847102:wigman"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["generate-mirror-repo-js_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"02c38a2d79e06ec8dd866e6eb3f98e35c28e13b881703e9a960471c488b5f547\"" -> "W/\"0fc81d1620cdc6c894e35ab3ab20a45d22f9f83780f78f555f3a8cb96b2464ef\""
        id         = "6847100:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["infrastructure_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"caac934bcacd374efaa7cef63cb5517eeebe5327cdca12bdff6db15c09baf8c5\"" -> "W/\"e0b88a2155c32c84005ca0032092e0887a940df3e03c60309fde4d34809f5ed9\""
        id         = "6847100:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mage-os-website_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"ef54c33f9a3bda4da8b8d901c8f0715e231cd7f0f485d9243153731bc0b67252\"" -> "W/\"c6cfff7270a155ce3c6907d5a0dd823fcf24c93dcc7996b5b04224a7d3e7f6fe\""
        id         = "6847102:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-adobe-stock-integration_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"dcd992b0e850f95950476d5ba05da2d340a327bc34b60c9978602f7128ea8087\"" -> "W/\"17c1436c3e12ac1a623dd7658d34c29b52b33c90100d6af8d50fee1857196e7e\""
        id         = "6847101:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-commerce-data-export_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"538a0dc3a3c46881bb7078a8406d1c96ac5b19d4929f3d0e29abd20521d06301\"" -> "W/\"1bc1b60ba27a87732b736d40acd54f376d1228d2326cba4c6fad500ad12f5aeb\""
        id         = "6847101:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"dd2b05cae3659ec9a52e92aedc47daf8b90d1e8621751ed833cd25ee57d2adf2\"" -> "W/\"f187bc50d18453667c7f017541ef3fabed6dd2fdf6f27b5814830bd99e21a36d\""
        id         = "6847101:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-root-update-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"9661e0b2fedf4400e9de1f75e9fff9ed2ea225f3cb64733c108fe8390e440556\"" -> "W/\"dd118d1816202656cfba9807c6197ea7a99192140db55b5463ab5e15ec39b393\""
        id         = "6847101:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1743ea221dbb52219fd94cdf5d7c7a90674e23b7992bb8e928932300c0922a11\"" -> "W/\"1973b5386afe318f3ee573a1077079e20285683b0510569f5b1e8ee70f948e42\""
        id         = "6847101:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"2dcb1063fe30ade7f85d96c0d0f3d23e89e456166e4f55177a9b026c50abf937\"" -> "W/\"80a3c841af50d1cdc06285170a092ad160fd2b61781644ca0ec4f71b2c5c41a2\""
        id         = "6847101:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"ce1d38235ea5de7724d784ff1af081f3643552dd13f6d70b8500ddf889d6f3f0\"" -> "W/\"b30ea3750d6bc471355761eb2b9076b6db38939e5f5196d2c4b4db1959e65d43\""
        id         = "6847101:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-page-builder_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e1a0079c2ab963b0d8cf6bf2f4d4494264c4706060c78f5c111c00e5502401ef\"" -> "W/\"d78e5b251e483d35508d1625bb1170efd2d6cd919632b8062458da0e113ab5d9\""
        id         = "6847101:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-sample-data_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"c779e11b66ad9e360c5e8fe5f073e059b5944821f94c13a856c805afdffada75\"" -> "W/\"8ff3ff661aab07fece58c2132a69d8b175cb4f318051a3ca6b4edbac2254f47d\""
        id         = "6847101:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"b19e5fd7af2ab673375af4a6f1a26523b3fc8a02553695227ada401977505a4e\"" -> "W/\"f48ad7a207c27d26aa4e467ee1d937d826bd770066eba515a7ed1ed2d6b30751\""
        id         = "6847101:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-security-package_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"df142113efd4330d646b1eb063e53522c9b27ea397e98a856dfe567907246ef7\"" -> "W/\"c64caeedd98429abfa23bf6168e34f65e0f0b6d49d097edd61f6b72c0fd0aa5e\""
        id         = "6847101:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["namespace_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6cad93585d75ba0e3ab890d01d2e1a775a1d22e16ae20a1d947421d7ecab8688\"" -> "W/\"7df4ab9760b0512cc75f856e33bedb48dcf04d54c97534726a147d4d05b45df8\""
        id         = "6847100:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["generate-mirror-repo-js"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"55bc16fdd0859e40aa2073f5cadac6da6ae03ff3dbb5114cc072704690ae43e4\"" -> "W/\"4514e42cbdad8b832c9232539c8506824880dd9ed9cd363438a7468e9cf4950b\""
        id         = "6847098:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["infrastructure"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"b004483d0e0ddd6014bdd633829165df8b6b09ba4fa28a5eee700dd4db670b54\"" -> "W/\"5e6dc9ba4afc34e8d479cffd02d6a394acd5831a66a2b71aa7932874221256f7\""
        id         = "6847098:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mage-os-website"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"c2881822c9f781ffcf53aafaacba0dd285f3fa6ad802f5cca9fca59ec907e1fc\"" -> "W/\"cc07a66650e92d107ba0e2e4afd3f0d5aa661e4185ebd1a52cee1374f7a8a24b\""
        id         = "6847098:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-adobe-stock-integration"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"fd316401c874cf24684a069bdc768b3ccae375a8236457c34ab49226b0dc50d0\"" -> "W/\"8fedeb7973003cbc22c7d3d756a12bb9253feb1e84e5bf125b55e8eab4adaadb\""
        id         = "6847098:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-commerce-data-export"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"cff4394f9ccc228a8e64be5796f4b4d3b37a166ba759102ac76839c622838c08\"" -> "W/\"5edbba1521789a72979ec372aae709494b75a87c712bd7b74b65f7029194820d\""
        id         = "6847098:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"db726e0cafd0dbca25d664d85475d40d4379d5ad9b28efc5ea7c561428b2e4fb\"" -> "W/\"4fafa8378cd2d3e8c2001a989a33c9a73a44a82badf5254439fc1d94a0aa81e7\""
        id         = "6847098:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"0a4707429b03253061ed87347e1e5a0ed291f91ba67caddd1feb73c2f7f30013\"" -> "W/\"60fae0edf65b7602964f21a6f1fb0e226bc064ca8182893ac868169fb881989e\""
        id         = "6847098:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"8734e7f68f5bc3da660b0d975a3f6f84fbc1fad19549491d5c95f868af7dd408\"" -> "W/\"8055cd252e8d127d7b7d2369aa80a7b95469f934bd6bfb86ecc766fbf003c98b\""
        id         = "6847098:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"023fc02600a144519405c0d354e7b3dfef7cdfbe893c68b250a7963f25a8a59e\"" -> "W/\"415a0187c7e2eb084dda13fbcb2b8c9cd20db8a7581ae8218751d65efaa06d98\""
        id         = "6847098:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"a9c6b5ba44aadb06ec46280bab973084c8916c910ce1b37508f15e7b9f2ba1a5\"" -> "W/\"8199088092b3ffd64289a8e0f39c1199f9a750cd212164d6ebf73e1e8cdbbf88\""
        id         = "6847098:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"7a486687783865b5a1b58616e6423509c8fe4a740f4a6bd8852f2657999fbd53\"" -> "W/\"81eb0e68c008a09d40ae55d2a415c3abddf1c05ae3d1a4f4abe94ea46d18baa1\""
        id         = "6847098:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-page-builder"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"ce37a63f2f85dfc3db595ea00a592500c5d063d4a947f83843aac2ac5b9c79a3\"" -> "W/\"d4d864e0a8f6bdd277ef91a879f2d758c9b0fa25ad1669ba93fdc99273f98ce2\""
        id         = "6847098:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-sample-data"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"d5e31b8019c239cc1c1bb2f823e8b76ea3bc5b015399c9e7ef36534096107e86\"" -> "W/\"fb0d15bf9e0fd57fda4cf8c9b1a5a210135a5e72894905eb7a1d4952ebf2b756\""
        id         = "6847098:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-security-package"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"8966b6007da72d039d747611421f873b8c5f9d1dec5e4eaa591fd4fa5fee50bb\"" -> "W/\"50f8b696dcc4fd2b6dfc8db4e7b03f02b784f71120d5b9dc52389bd1113669be\""
        id         = "6847098:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["namespace"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"4185e189eb34115cd41a081da3377ff8b68fe38ef49a44e245433bedbb81013d\"" -> "W/\"32d82b4d2cfd35300f12399f667f13dc2ccd77515e235029490c231b0ce1ea9f\""
        id         = "6847098:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["terraform"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"9bd0c28f553d39aa88455dca1faa5855cfbc7c65123991d14662b321929d42c7\"" -> "W/\"6edde39ab4ac14892132ad7d7b2b7372dea8d3598d537ad37ed366ead7b5fead\""
        id         = "6847098:terraform"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.repositories["dev-env-gitpod"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.repositories["dev-env-gitpod"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Mage-OS development environment via Gitpod."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "dev-env-gitpod"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
    }

  # github_repository_file.codeowners["dev-env-gitpod"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = (known after apply)
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/infrastructure"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "dev-env-gitpod"
      + sha                 = (known after apply)
    }

  # github_team_repository.teams["dev-env-gitpod_infrastructure"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "dev-env-gitpod"
      + team_id    = "infrastructure"
    }

  # github_team_repository.tech-lead["dev-env-gitpod"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "dev-env-gitpod"
      + team_id    = "6847098"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/3526472867